app/controllers/user_controller.rb

INSERT INTO `users` (`name`, `city`, `created_at`, `avatar_file_name`, `avatar_file_size`, `country`, `updated_at`, `avatar_content_type`, `avatar_updated_at`) VALUES('vtr', 'hyd', '2011-04-10 17:20:57', NULL, NULL, 'vtr', '2011-04-10 17:20:57', NULL, NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def edit
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `updated_at` = '2011-04-12 03:09:32', `avatar_file_size` = 190203, `avatar_file_name` = 'activation.jpg', `avatar_updated_at` = '2011-04-12 03:09:25', `avatar_content_type` = 'image/jpeg' WHERE `id` = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 2)
DELETE FROM `users` WHERE `id` = 2
---
  def delete
    @user = User.find(params[:id])
    if @user.destroy